const state = () => [
  {
    title: 'продукты',
    img: 'groceries',
    items: [
      { title: 'молоко, яйца, сыр' },
      { title: 'мясо' },
      { title: 'рыба и морепродукты' },
      { title: 'овощи' },
      { title: 'фрукты' },
      { title: 'зелень' },
      { title: 'хлеб' },
      { title: 'сладости' },
      { title: 'консервы' },
      { title: 'бакалея' },
      { title: 'замороженные продукты' }
    ]
  },
  {
    title: 'спорт',
    img: 'sports',
    items: [
      { title: 'молоко, яйца, сыр' },
      { title: 'мясо' },
      { title: 'рыба и морепродукты' },
      { title: 'овощи' },
      { title: 'замороженные продукты' }
    ]
  },
  {
    title: 'праздник',
    img: 'celebration',
    items: [
      { title: 'молоко, яйца, сыр' },
      { title: 'мясо' },
      { title: 'рыба и морепродукты' },
      { title: 'овощи' },
      { title: 'фрукты' },
      { title: 'зелень' },
      { title: 'хлеб' },
      { title: 'сладости' },
      { title: 'консервы' },
      { title: 'бакалея' },
      { title: 'замороженные продукты' }
    ]
  },
  {
    title: 'косметика',
    img: 'cosmetics',
    items: [
      { title: 'молоко, яйца, сыр' },
      { title: 'мясо' },
      { title: 'рыба и морепродукты' }
    ]
  },
  {
    title: 'дача',
    img: 'countryhouse',
    items: [
      { title: 'молоко, яйца, сыр' },
      { title: 'мясо' },
      { title: 'рыба и морепродукты' },
      { title: 'овощи' }
    ]
  },
  {
    title: 'гигиена',
    img: 'hygiene',
    items: [
      { title: 'молоко, яйца, сыр' },
      { title: 'мясо' },
      { title: 'рыба и морепродукты' },
      { title: 'овощи' },
      { title: 'фрукты' },
      { title: 'зелень' },
      { title: 'хлеб' },
      { title: 'сладости' },
      { title: 'консервы', items: ['телятина', 'говядина', 'птица'] },
      { title: 'бакалея' },
      { title: 'замороженные продукты' }
    ]
  },
  {
    title: 'дети',
    img: 'children',
    items: [
      { title: 'молоко, яйца, сыр' },
      { title: 'мясо' },
      { title: 'рыба и морепродукты' },
      { title: 'овощи' }
    ]
  },
  {
    title: 'канцтовары',
    img: 'office',
    items: [
      { title: 'молоко, яйца, сыр' },
      { title: 'мясо' },
      { title: 'рыба и морепродукты' },
      { title: 'овощи' },
      { title: 'фрукты' },
      { title: 'зелень' },
      { title: 'хлеб' },
      { title: 'сладости' },
      { title: 'консервы' },
      { title: 'бакалея' },
      { title: 'замороженные продукты' }
    ]
  },
  {
    title: 'аптека',
    img: 'pharmacy',
    items: [
      { title: 'молоко, яйца, сыр' },
      { title: 'мясо' },
      { title: 'рыба и морепродукты' },
      { title: 'овощи' },
      { title: 'фрукты' },
      { title: 'зелень' },
      { title: 'хлеб' },
      { title: 'сладости' },
      { title: 'консервы' },
      { title: 'бакалея' },
      { title: 'замороженные продукты' }
    ]
  },
  {
    title: 'зоотовары',
    img: 'pets',
    items: [
      { title: 'молоко, яйца, сыр' },
      { title: 'мясо' },
      { title: 'рыба и морепродукты' },
      { title: 'овощи' },
      { title: 'замороженные продукты' }
    ]
  },
  {
    title: 'ремонт',
    img: 'tools',
    items: [
      { title: 'молоко, яйца, сыр' },
      { title: 'мясо' },
      { title: 'рыба и морепродукты' },
      { title: 'овощи' },
      { title: 'замороженные продукты' }
    ]
  },
  {
    title: 'хозтовары',
    img: 'household',
    items: [
      { title: 'молоко, яйца, сыр' },
      { title: 'мясо' },
      { title: 'рыба и морепродукты' },
      { title: 'овощи' },
      { title: 'фрукты' },
      { title: 'зелень' },
      { title: 'хлеб' },
      { title: 'сладости' },
      { title: 'консервы', items: ['телятина', 'говядина', 'птица'] },
      { title: 'бакалея' },
      { title: 'замороженные продукты' }
    ]
  }
]

export default {
  state
}
